In [1]:
people = {
    "first": ["Prashant", "Dilip", "Vivek"],
    "last": ["Singh", "Singh", "Kumar"],
    "email": ["pk.airsqn@gmail.com", "dilip.singh@gmail.com", "vivek.krypton@outlook.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

      first   last                      email
0  Prashant  Singh        pk.airsqn@gmail.com
1     Dilip  Singh      dilip.singh@gmail.com
2     Vivek  Kumar  vivek.krypton@outlook.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ['first_name','last_name','email_address']

In [7]:
df

  first_name last_name              email_address
0   Prashant     Singh        pk.airsqn@gmail.com
1      Dilip     Singh      dilip.singh@gmail.com
2      Vivek     Kumar  vivek.krypton@outlook.com

In [8]:
# Upper /Lower Case
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name              email_address
0   Prashant     Singh        pk.airsqn@gmail.com
1      Dilip     Singh      dilip.singh@gmail.com
2      Vivek     Kumar  vivek.krypton@outlook.com

In [9]:
# Replace space or underscore
df.columns = df.columns.str.replace(' ','_')
df

  first_name last_name              email_address
0   Prashant     Singh        pk.airsqn@gmail.com
1      Dilip     Singh      dilip.singh@gmail.com
2      Vivek     Kumar  vivek.krypton@outlook.com

In [10]:
# Rename columns
df.rename(columns={'first_name':'first','last_name':'last','email_address':'email'}, inplace=True)

In [11]:
df

      first   last                      email
0  Prashant  Singh        pk.airsqn@gmail.com
1     Dilip  Singh      dilip.singh@gmail.com
2     Vivek  Kumar  vivek.krypton@outlook.com

In [12]:
# Update(row) last name

df.loc[2] = ['Vivek','Pandey','vivel.krypton@outlook.com']
df

      first    last                      email
0  Prashant   Singh        pk.airsqn@gmail.com
1     Dilip   Singh      dilip.singh@gmail.com
2     Vivek  Pandey  vivel.krypton@outlook.com

In [13]:
 df.loc[2,['last','email']] = ['Kumar','vivek@outlook.com']

In [14]:
df

      first   last                  email
0  Prashant  Singh    pk.airsqn@gmail.com
1     Dilip  Singh  dilip.singh@gmail.com
2     Vivek  Kumar      vivek@outlook.com

In [15]:
# Update one row
df.loc[2,'last'] = 'Kumar Pandey'
df

      first          last                  email
0  Prashant         Singh    pk.airsqn@gmail.com
1     Dilip         Singh  dilip.singh@gmail.com
2     Vivek  Kumar Pandey      vivek@outlook.com

In [16]:
df.at[2,'last'] = 'Kumar'
df

      first   last                  email
0  Prashant  Singh    pk.airsqn@gmail.com
1     Dilip  Singh  dilip.singh@gmail.com
2     Vivek  Kumar      vivek@outlook.com

In [17]:
# Data matching
filt = (df['email'] == 'vivek@outlook.com')
df[filt]['last'] = 'Pandey'

<ipython-input-17-38a6b29346ad>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Pandey'

In [18]:
filt = (df['email'] == 'vivek@outlook.com')
df.loc[filt,'last'] = 'Pandey'

In [19]:
df

      first    last                  email
0  Prashant   Singh    pk.airsqn@gmail.com
1     Dilip   Singh  dilip.singh@gmail.com
2     Vivek  Pandey      vivek@outlook.com

In [20]:
# to lowercase
df['email'].str.lower()

0      pk.airsqn@gmail.com
1    dilip.singh@gmail.com
2        vivek@outlook.com
Name: email, dtype: object

In [21]:
# length
df['email'].apply(len)

0    19
1    21
2    17
Name: email, dtype: int64

In [22]:
def update_email(email):
    return email.upper()

In [23]:
df['email'].apply(update_email)

0      PK.AIRSQN@GMAIL.COM
1    DILIP.SINGH@GMAIL.COM
2        VIVEK@OUTLOOK.COM
Name: email, dtype: object

In [24]:
df['email'] = df['email'].apply(update_email)

df

      first    last                  email
0  Prashant   Singh    PK.AIRSQN@GMAIL.COM
1     Dilip   Singh  DILIP.SINGH@GMAIL.COM
2     Vivek  Pandey      VIVEK@OUTLOOK.COM

In [25]:
df['email'] = df['email'].apply(lambda x: x.lower())

df

      first    last                  email
0  Prashant   Singh    pk.airsqn@gmail.com
1     Dilip   Singh  dilip.singh@gmail.com
2     Vivek  Pandey      vivek@outlook.com

In [26]:
df['email'].apply(len)

0    19
1    21
2    17
Name: email, dtype: int64

In [27]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [28]:
df

      first    last                  email
0  Prashant   Singh    pk.airsqn@gmail.com
1     Dilip   Singh  dilip.singh@gmail.com
2     Vivek  Pandey      vivek@outlook.com

In [29]:
len(df['email'])

3

In [31]:
df.apply(pd.Series.min)

first                    Dilip
last                    Pandey
email    dilip.singh@gmail.com
dtype: object

In [32]:
df.apply(lambda x: x.min())

first                    Dilip
last                    Pandey
email    dilip.singh@gmail.com
dtype: object

In [33]:
# Apply map only works on dataframes and not on Series

df.applymap(len)

   first  last  email
0      8     5     19
1      5     5     21
2      5     6     17

In [34]:
df.applymap(str.lower)

      first    last                  email
0  prashant   singh    pk.airsqn@gmail.com
1     dilip   singh  dilip.singh@gmail.com
2     vivek  pandey      vivek@outlook.com

In [36]:
# map onnly works on series
df['first'].map({'Prashant':'Prash','Dilip':'Dileep'})

0     Prash
1    Dileep
2       NaN
Name: first, dtype: object

In [40]:
df['first'] = df['first'].replace({'Prashant':'Prash','Dilip':'Dileep'})
df.head()

    first    last                  email
0   Prash   Singh    pk.airsqn@gmail.com
1  Dileep   Singh  dilip.singh@gmail.com
2   Vivek  Pandey      vivek@outlook.com